{
  "GSI": [
    {
      "Id": 1,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Evaluate the nature of the Bhakti literature and its contribution to Indian culture. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 2,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Trace the rise and growth of socio-religious reform movements with special reference to Young Bengal and Brahmo Samaj. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 3,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Assess the main administrative issues and socio-cultural problems in the integration process of Indian Princely States. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 4,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Examine the uniqueness of tribal knowledge system when compared with mainstream knowledge and cultural systems. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 5,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Examine the role of 'Gig Economy' in the process of empowerment of women in India. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 6,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "To what extent did the role of the Moderates prepare a base for the wider freedom movement? Comment. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 7,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Bring out the constructive programmes of Mahatma Gandhi during Non-Cooperation Movement and Civil Disobedience Movement.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 8,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "\"There arose a serious challenge to the Democratic State System between the two World Wars.\" Evaluate the statement. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 9,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "What are the main socio-economic implications arising out of the development of IT industries in major cities of India? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 10,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Discuss the main objectives of Population Education and point out the measures to achieve them in India in detail. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 11,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "What is Cryptocurrency? How does it affect global society? Has it been affecting Indian society also? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 12,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "How does Indian society maintain continuity in traditional social values Enumerate the changes taking place in it. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 13,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Differentiate the causes of landslides in the Himalayan region and Western Ghats. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 14,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Despite India being one of the countries of the Gondwanaland, its mining industry contributes much less to its Gross Domestic Product (GDP) in percentage. Discuss. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 15,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "What are the environmental implications of the reclamation of water bodies into urban land use? Explain with examples. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 16,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Mention the global occurrence of volcanic eruptions in 2021 and their impact on regional environment. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 17,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Why is India considered as a subcontinent? Elaborate your answer.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 18,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Briefly mention the alignment of major mountain ranges of the world and explain their impact on local weather conditions, with examples.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 19,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "How do the melting of the Arctic ice and glaciers of the Antarctic differently affect the weather patterns and human activities on the Earth ? Explain.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 20,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Discuss the multi-dimensional implications of uneven distribution of mineral oil in the world. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 21,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "The rock-cut architecture represents one Of the most important sources of our knowledge of early Indian art and history. Discuss. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 22,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Pala period is the most significant phase in the history of Buddhism in India. Enumerate. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 23,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Evaluate the policies of Lord Curzon and their long term implications on the national movement. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 24,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Has caste lost its relevance in Understanding the multi-cultural Indian Society? Elaborate your answer with illustrations. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 25,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "COVID-19 pandemic accelerated class inequalities and poverty in India. Comment. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 26,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "DO you agree that regionalism in India appears to be a consequence Of rising cultural assertiveness? Argue. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 27,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Indian philosophy and tradition played a significant role in conceiving and shaping the monuments and their art in India. Discuss. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 28,
      "Paper": "GS-I",
      "Year": 2021,
      "Question": "Persian literary sources of Medieval India reflect the spirit of the age. Comment.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 29,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Since the decade Of the 1920s, the national movement acquired various ideological strands and thereby expanded its social base. Discuss. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 30,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Account for the huge flooding Of million cities in India including the smart ones like Hyderabad and Pune. Suggest lasting remedial measures. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 31,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Is diversity and pluralism in India under threat due to globalisation? Justify your answer. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 32,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Customs and traditions suppress reason leading to obscurantism. DO you agree? (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 33,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "How have digital initiatives in India contributed to the functioning Of the education system in the country? Elaborate on your answer. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 34,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Discuss the geophysical characteristics of Circum-Pacific Zone.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 35,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "The process of desertification does not have climatic boundaries. Justify with examples.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 36,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "How will the melting of Himalayan glaciers have a far-reaching impact on the water resources of India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 37,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "The interlinking of rivers can provide viable solutions to the multi-dimensional inter-related problems of droughts, floods and interrupted navigation. Critically examine.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 38,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "India has immense potential of solar energy though there are regional variations in its development. Elaborate",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 39,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Examine the status of forest resources of India and its resultant impact on climate change.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 40,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Account for the present location of iron and steel industries away from the source of raw material, by giving examples.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 41,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Account for the huge flooding of million cities in India including the smart ones like Hyderabad and Pune. Suggest lasting remedial measures.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 42,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Highlight the Central Asian and Greco-Bactrian elements in Gandhara art.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 43,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "The 1857 Uprising was the culmination of the recurrent big and small local rebellions that had occurred in the preceding hundred years of British rule. Elucidate. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 44,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Examine the linkages between the nineteenth century's 'Indian Renaissance' and the emergence of national identity. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 45,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Can the strategy of regional resource-based manufacturing help in promoting employment in India ? (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 46,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "What makes the Indian society unique in sustaining its culture ? Discuss. (Answer in 150 Words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 47,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "\"Empowering women is the key to control population growth.\" Discuss. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 48,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "What are the challenges to Our cultural practices in the name Of secularism ? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 49,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Many voices had strengthened and enriched the nationalist movement during the Gandhian phase. Elaborate. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 50,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Assess the role of British imperial power in complicating the process Of transfer of power during the 1940s. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 51,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Explain how the foundations of the modern world were laid b' the American and French Revolutions. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 52,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "How is emcient and affordable urban mass transport key to the rapid economic development of India ? (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 53,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Do we have cultural pockets of small India all over the nation ? Elaborate with examples. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 54,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "What are the continued challenges for women in India against time and space ? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 55,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Are we losing our local identity for the global identity ? Discuss. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 56,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "Assess the impact of global warming on coral life system with examples.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 57,
      "Paper": "GS-I",
      "Year": 2020,
      "Question": "How do ocean currents and water masses differ in their impacts on marine life and the coastal environment? Give suitable examples?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 58,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Discuss the causes of depletion of mangroves and explain their importance in maintaining coastal ecology.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 59,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "How can the mountain ecosystem be restored from the negative impact of development initiatives and tourism?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 60,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "What is water stress? How and why does it differ regionally in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 61,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Empowering women is the key to control population growth. Discuss",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 62,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "What are the continued challenges for women in India against time and space?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 63,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Discuss the factors for localization of agro-based food processing industries of North-West India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 64,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "How is efficient and affordable urban mass transport key to the rapid economic development of India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 65,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Safeguarding the Indian art heritage is the need of the moment. Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 66,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Assess the importance of the accounts of the Chinese and Arab travellers in the reconstruction of the history Of India. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 67,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Throw light on the significance of the thoughts of Mahatma Gandhi in the present times. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 68,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "\"Caste system is assuming new identities and associational forms. Hence, caste system cannot be eradicated in India.\" Comment. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 69,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Despite implementation Of various programmes for eradication Of poverty by the government in India, poverty is still existing.' Explain by giving reasons.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 70,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "How the Indian concept of secularism is different from the western model of secularism? Discuss. (Answer in 150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 71,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "The Bhakti movement received a remarkable re-orientation With the advent Of Sri Chaitanya Mahaprabhu- Discuss. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 72,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Discuss whether formation of new states in recent times is beneficial or not for the economy of India. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 73,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Why indentured labour Was taken by the British from India to Other colonies? Have they been able to preserve their cultural identity over there? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 74,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Mention core strategies for the transformation Of aspirational districts in India and explain the nature of convergence, collaboration and competition for its success.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 75,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Women's movement in India has not addressed the issues of women of lower social strata.' Substantiate your view. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 76,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Globalization is generally said to promote cultural homogenization but due to this cultural specificities appear to be strengthened in the Indian Society.' Elucidate.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 77,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Communalism arises either due to power struggle or relative deprivation.' Argue by giving suitable illustrations. (Answer in 250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 78,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Why is India taking keen interest in resources of Artic region?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 79,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Why is Indian Regional Navigational Satellite System (IRNSS) needed? How does it help in navigation?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 80,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Define mantle plume and explain its role in plate tectonics.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 81,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "What are the consequences of spreading of Dead Zones on marine ecosystem?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 82,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Women's movement in India has not addressed the issue of women of lower social strata. Substantiate your view.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 83,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Define blue revolution, explain the problems and strategies for pisciculture development in India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 84,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "What is the significance of Industrial Corridors in India? Identify industrial corridors, explain their main characteristics.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 85,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "“The ideal solution of depleting ground water resources in India is water harvesting system.” How can it be made effective in urban areas?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 86,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "How do you justify the view that the level of excellence of the Gupta numismatic art is not at all noticeable in later times ? (150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 87,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Clarify how mid-eighteenth century India was beset with the spectre of a fragmented polity. (150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 88,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "Why did the 'Moderates' fail to carry conviction with the nation about their proclaimed ideology and political goals by the end of the nineteenth century ? (150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 89,
      "Paper": "GS-I",
      "Year": 2019,
      "Question": "What problems were germane to the decolonization process in the Malay Peninsula ? (150 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 90,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "In the context of the diversity of India, can it be said that the regions form cultural units rather than the States ? Give reasons with examples for your viewpoint. (150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 91,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "What are the two major legal initiatives by the State since Independence, addressing discrimination against Scheduled Tribes (STs) ? (150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 92,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "The spirit of tolerance and love is not only an interesting feature of Indian Society from very early times, but it is also playing an important part at the present. Elaborate. (250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 93,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Examine how the decline of traditional artisanal industry in colonial India crippled the rural economy. (250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 94,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Highlight the importance of the new objectives that got added to the vision of Indian independence since the twenties of the last century. (250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 95,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "The women's questions arose in modern India as a part of the 19 century reform movement. What were the major issues and debates concerning women in that period ? (250 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 96,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Distinguish betwæn religiousness/religiosity and communalism giving one example of how the former has got transformed into the latter in independent India. (250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 97,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "\"The growth of cities as I.T. hubs has opened up new avenues of employment, but has also created new problems.\" Substantiat.e this statement with examples. (250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 98,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "How does the Juno Mission of NASA help to understand the origin and evolution of the Earth?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 99,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "In spite of adverse environmental impact, coal mining is still inevitable for development.” Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 100,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Mention the advantages of the cultivation of pulse because of which the year 2016 was declared as the International Year of Pulses by the United Nations.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 101,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "How does the cryosphere affect global climate?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 102,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Account for variations in oceanic salinity and discuss its multi-dimensional effects.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 103,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "In what way can flood be converted into a sustainable source of irrigation and all-weather inland navigation in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 104,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "What characteristics can be assigned to monsoon climate that succeeds in feeding more than 50 percent of the won population residing in Monsoon Asia?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 105,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Petroleum refineries are not necessarily located nearer to crude oil producing areas, particularly in many of the developing countries. Explain its implications.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 106,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "The growth of cities as I.T. hubs has opened up new avenues employment but has also created new problems. Substantiate this statement with examples. Urbanization",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 107,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Early Buddhist Stupa-art, while depicting folk motifs and narratives successfully expounds Buddhist ideals. Elucidate.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 108,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Krishnadeva Raya, the King of Vijayanagar, was not only an accomplished scholar himself but was also a great patron of learning and literature. Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 109,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Explain how the Uprising of 1857 constitutes an important watershed in the evolution of British policies towards colonial India.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 110,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Discuss the role of women in the freedom struggle especially during the Gandhian phase.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 111,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Highlight the differences in the approach of Subhash Chandra Bose and Mahatma Gandhi in the struggle for freedom.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 112,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Has the formation Of linguistic States strengthened the cause of Indian Unity?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 113,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "The anti-colonial struggles in West Africa were led by the new elite of Western-educated Africans. Examine.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 114,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "To what extent globalization has influenctxl the core Of cultural diversity in India? Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 115,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "\"An essential condition to eradicate poverty is to liberate the poor from the process of deprivation.\" Substantiate this statement with suitable examples.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 116,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "Why are the tribals in India referred to as the Scheduled Tribes? Indicate the major provisions enshrined in the Constitution of India for their upliftment.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 117,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "With a brief background of quality of urban life in India, introduce the objectives and of the 'Smart City Programme'.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 118,
      "Paper": "GS-I",
      "Year": 2018,
      "Question": "What is the basis of regionalism? Is it that unequal distribution of benefits of development on regional basis eventually promotes regionalism? Substantiate your answer.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 119,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "“The Himalayas are highly prone to landslides.” Discuss the causes and suggest suitable measures of mitigation.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 120,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Discuss the concept of air mass and explain its role in macro-climatic changes.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 121,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "With a brief background of quality of urban life in India, introduce the objectives and strategy of the ‘Smart City Programme’.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 122,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Major cities of India are becoming more vulnerable to flood conditions. Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 123,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "The ancient civilization in Indian sub-continent differed from those of Egypt, Mesopotamia and Greece in that its culture and traditions have been preserved without a breakdown to the present day. Comment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 124,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Mesolithic rock cut architecture of India not only reflects the cultural life of the times but also a fine aesthetic sense comparable to modern painting. Critically evaluate this comment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 125,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "How different would have Eren the achievement of Indian independence without Mahatma Gandhi ? Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 126,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Mahatma Gandhi and Dr. B.R. Ambedkar despite having divergent approaches and strategies, had a common goal of amelioration of the downtrodden. Elucidate.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 127,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "It would have been difficult for the Constituent Assembly to complete its historic task of drafting the Constitution for Independent India in just three years but for the experience gained with the Government of India Act, 1935. Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 128,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Why did the industrial revolution first occur in England ? Discuss the quality of life of the people there during the industrialization. How does it compare with that in India at present ?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 129,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "To what extent can Germany be held responsible for causing the two World Wars ? Discuss critically.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 130,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Describe any four cultural elements of diversity in India and rate their relative significance in building a national identity.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 131,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Critically examine whether growing population is the cause of poverty OR poverty is the main cause of population increase in India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 132,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "How do you explain the statistics that show that the sex ratio in Tribes in India is more favourable to women than the sex ratio among Scheduled Castes?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 133,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Discuss the changes in the trends of labour migration within and outside India in the last four decades.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 134,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Discuss the positive and negative effects of globalization on women in India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 135,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Debate the issue Of whether and how contemporary movements for assertion of Dalit identity work towards annihilation Of caste.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 136,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Explain the factors responsible for the origin of ocean currents. How do they influence regional climates, fishing and navigation?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 137,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "How far do you agree that the behavior of the Indian monsoon has been changing due to humanizing landscapes? Discuss.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 138,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Mumbai, Delhi and Kolkata are the three mega cities of the country but the air pollution is much more serious problem in Delhi as compared to the other two. Why is this so?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 139,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Smart cities in India cannot sustain without smart villages. Discuss this statement in the backdrop of rural urban integration.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 140,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "To what extent has the urban planning and culture of the Indus Valley Civilization provided inputs to the present day urbanization ? Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 141,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Gandhara sculpture owed as much to the Romans as to the Greeks. Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 142,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Taxila university was one of the oldest universities of the world with which were associated a number of learned personalities of different disciplines. Its strategic locat.ion caused its fame to flourish, but unlike Nalanda, it is not considered as a university in the modem sense. Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 143,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "The third battle of Panipat was fought in 1761. Why were so many empire-shaking battles fought at Panipat?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 144,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Sufis and medieval mystic saints failed to modify either the religious ideas and practices or the outward structure of Hindu / Muslim scwietiæ to any appreciable extent. Comment.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 145,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "Examine critically the various facets of economic policies of the British in India from mid-eighteenth century till independence.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 146,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "In what ways did the naval mutiny prove to be the last nail in the coffin of British colonial aspirations in India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 147,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "What were the major political; economic and social developments in the world which motivated the anti-colonial struggle in India'?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 148,
      "Paper": "GS-I",
      "Year": 2017,
      "Question": "What were the évedts that led to the Suez Crisis in 1956? How did it deal a final blow to Britain's self-image as a world power?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 149,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "The New Economic Policy — 1921 of Lenin had influenced the policies adopted by India soon after independence. Evaluate.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 150,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "How does patriarchy impact the position of a middle-class working woman in India?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 151,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Why do some of the most prosperous regions Of India have an adverse Sex ratio for Women? Give your arguments.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 152,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "The life cycle Of a joint family depends on economic factors rather than social values. Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 153,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Discuss the various economic and socio-cultural forces that are driving increasing feminization of agriculture in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 154,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "HOW do the Indian debates on •secularism differ from the debates in the West?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 155,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Explain the formation of thousands of islands in Indonesian and Philippines archipelagos.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 156,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Why are the world’s fold mountain systems located along the margins of continents? Bring out the association between the global distribution of Fold Mountains and the earthquakes and volcanoes.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 157,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Tropical cyclones are largely confined to South China Sea, Bay of Bengal and Gulf of Mexico. Why?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 158,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Most of the unusual climatic happenings are explained as an outcome of the El-Nino effect. Do you agree?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 159,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Bring out the relationship between the shrinking Himalayan glaciers and the symptoms of climate change in the Indian sub-continent.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 160,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "How does patriarchy impact the position of a middle class working woman in India?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 161,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Whereas the British planters had developed tea gardens all along the Shivaliks and Lesser Himalayas from Assam to Himachal Pradesh, in effect they did not succeed beyond the Darjeeling area. Explain.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 162,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Account for the change in the spatial pattern of the Iron and Steel industry in the world.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 163,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Why did the Green Revolution in India virtually by-pass the eastern region despite fertile soil and good availability of water?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 164,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Though not very useful from the point of view of a connected political history of South India, the Sangam literature portrays the social and economic conditions of its time with remarkable vividness. Comment. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 165,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Discuss the 'Tandava' dance as recorded in early Indian inscriptions. (100 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 166,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Chola architecture represents a high watermark in the evolution of temple architecture. Discuss. (100 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 167,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Defying the barriers of age, gender and religion, the Indian women became the torch- bearer during the struggle for freedom in India. Discuss. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 168,
      "Paper": "GS-I",
      "Year": 2016,
      "Question": "Several foreigners made India their homeland and participated in various movements. Analyze their role in the Indian struggle for freedom. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 169,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "\"In many ways, Lord Dalhousie was the founder of modern India.\" Elaborate. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 170,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Critically discuss the objectives of Bhoodan and Gramdan Movements initiated by Acharya Vinoba Bhave and their success. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 171,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Write a critical note on the evolution and significance of the slogan, 'Jai Jawan Jai Kisan'. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 172,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Discuss the contributions of Maulana Abul Kalam Azad to pre- and post- independent India. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 173,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Analyze the circumstances that led to the Tashkent Agreement in 1966. Discuss the highlights of the Agreement. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 174,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Critically examine the compulsions which prompted India to play a decisive role in the emergence of Bangladesh. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 175,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Latecomer' Industrial Revolution in Japan involved certain factors that were markedly different from what West had experienced.\" Analyze. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 176,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "\"Africa was chopped into States artificially created by accidents of European competition.\" Analyze. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 177,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "\"American Revolution was an economic revolt against mercantilism.\" Substantiate. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 178,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "What policy instruments were deployed to contain the Great Economic Depression? (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 179,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Discuss the various social problems which originated out of the speedy process of urbanization in India. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 180,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "\"Male membership needs to be encouraged in order to make women's organizations free from gender bias.\" Comment. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 181,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Critically examine the effect of globalization on the aged population in India. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 182,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Growing feeling of regionalism is an important factor in generation of demand for a separate State. Discuss. (200 words)",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 183,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "What do you understand by the theory of continental drift? Discuss the prominent evidences in its support.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 184,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "There is.no formation of deltas by rivers of the Western Ghat. Why?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 185,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Major hot deserts in northern hemisphere are located between 20-30 degree north and on the western side of the continents. Why?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 186,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Bring out the causes for more frequent landslides in the Himalayas than in Western Ghats.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 187,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "The recent cyclone on the east coast of India was called “Phailin”. How are the tropical cyclones named across the world?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 188,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Bring out the causes for the formation of heat islands in the urban habitat of the world.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 189,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "What do you understand by the phenomenon of temperature inversion in meteorology? How does it affect the weather and the habitants of the place?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 190,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Do you agree that there is a growing trend of opening new Sugar mills in the Southern states of India? Discuss with Justification.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 191,
      "Paper": "GS-I",
      "Year": 2015,
      "Question": "Analyze the factors for highly decentralized cotton textile industry in India.",
      "WordLimit": 200,
      "Marks": 12.5
    }
  ],
  "GSII": [
    {
      "Id": 1,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "‘Constitutional Morality’ is rooted in the Constitution itself and is founded on its essential facets. Explain the doctrine of ‘Constitutional Morality’ with the help of relevant judicial decisions.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 2,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Discuss the desirability of greater representation to women in the higher judiciary to ensure diversity, equity and inclusiveness.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 3,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "How have the recommendations of the 14th Finance Commission of India enabled the States to improve their fiscal position?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 4,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "To what extent, in your view, the Parliament is able to ensure accountability of the executive in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 5,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "“Pressure groups play a vital role in influencing public policy making in India.” Explain how the business associations contribute to public policies.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 6,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "‘Besides being a moral imperative of a Welfare State, primary health structure is a necessary precondition for sustainable development.” Analyze.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 7,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "“Earn while you learn’ scheme needs to be strengthened to make vocational education and skill training meaningful.” Comment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 8,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Can the vicious cycle of gender inequality, poverty and malnutrition be broken through microfinancing of women SHGs? Explain with examples.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 9,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "“If the last few decades were of Asia’s growth story, the next few are expected to be of Africa’s.” In the light of this statement, examine India’s influence in Africa in recent years.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 10,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "“The USA is facing an existential threat in the form of a China, that is much more challenging than the erstwhile Soviet Union.” Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 11,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "The jurisdiction of the Central Bureau of Investigation (CBI) regarding lodging an FIR and conducting probe within a particular State is being questioned by various States. However, the power of the States to withhold consent to the CBI is not absolute. Explain with special reference to the federal character of India.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 12,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Though the Human Rights Commissions have contributed immensely to the protection of human rights in India, yet they have failed to assert themselves against the mighty and powerful. Analyzing their structural and practical limitations, suggest remedial measures.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 13,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Analyze the distinguishing features of the notion of Right to Equality in the Constitutions of the USA and India.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 14,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Explain the constitutional provisions under which Legislative Councils are established. Review the working and current status of Legislative Councils with suitable illustrations.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 15,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Do Department-related Parliamentary Standing Committees keep the administration on its toes and inspire reverence for parliamentary control? Evaluate the working of such committees with suitable examples.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 16,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Has digital illiteracy, particularly in rural areas, coupled with lack of Information and Communication Technology (ICT) accessibility hindered socio-economic development? Examine with justification.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 17,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "“Though women in post-Independent India have excelled in various fields, the social attitude towards women and feminist movement has been patriarchal.” Apart from women education and women empowerment schemes, what interventions can help change this milieu?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 18,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Can civil Society and Non-Governmental Organizations present an alternative model of public service delivery to benefit the common citizen? Discuss the challenges of this alternative model.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 19,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "Critically examine the aims and objectives of SCO. What importance does it hold for India?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 20,
      "Paper": "GS-II",
      "Year": 2021,
      "Question": "The newly tri-nation partnership AUKUS is aimed at countering China’s ambitions in the Indo-Pacific region. Is it going to supersede the existing partnerships in the region? Discuss the strength and impact of AUKUS in the present scenario.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 21,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“There is a need for simplification of procedure. for disqualification of persons found guilty of corrupt practices under the Representation of Peoples Act”. Comment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 22,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“Recent amendments to the Right to Information Act will have profound impact on the autonomy and independence of the Information Commission”. Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 23,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "How far do you think cooperation, competition atid confrontation have shaped the nature of federation in India? Cite same recent examples to validate your answer.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 24,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "The judicial systems in India and UK seer to be converging as well as diverging in recent timds. Highlight the key points of convergence and divergence between the two nations in terms of their judicial practices.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 25,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "‘Once a Speaker, Always a Speaker’ ! Do you think this practice should be adopted to impart objectivity to the office of the Speaker of Lok Sabha? What could be its implications for the robust functioning of parliamentary business in India ?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 26,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "In order to enhance the prospects of social development, sound and adequate health care policies are needed particularly in the fields of geriatric and maternal healthcare. Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 27,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“Institutional quality is a crucial driver of economic performance”. In this context suggest reforms in Civil Service for strengthening democracy.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 28,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“The emergence of Fourth Industrial Revolution (Digital Revolution) has initiated e-Governance as an integral part of government”. Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 29,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "Critically examine the role of WHO in providing global health security during the Covid-19 pandemic.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 30,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "‘Indian diaspora has a decisive role to play in the politics and economy of America and European Countries’. Comment with examples.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 31,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "Indian Constitution exhibits centralising tendencies to maintain unity and integrity of the nation. Elucidate in the perspective of the Epidemic Diseases Act, 1897; The Disaster Management Act, 2005 and recently passed Farm Acts.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 32,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "Judicial Legislation is antithetical to the doctrine of separation of. powers as envisaged in the Indian Constitution. In this context justify the filing of large number of public interest petitions praying for issuing guidelines to executive authorities.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 33,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "The strength and sustenance of local institutions in India has shifted from their formative phase of ‘Functions, Functionaries and Funds’ to the contemporary stage of ‘Functionality’. Highlight the critical challenges faced by local institutions in terms of their functionality in recent times.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 34,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "Rajya Sabha has been transformed from a ‘useless stepney tyre’ to the most useful supporting organ in past few decades, Highlight the factors as well as the areas in which this transformation could be visible.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 35,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "Which steps are required for constitutionalization ofa Commission ? Do you think imparting constitutionality to the National Commission for Women would ensure greater gender justice and empowerment in India ?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 36,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“The incedence and intensity of poverty are more important in determining poverty based on income alone”. In this context analyse the latest United Nations Multidimensional Poverty Index Report.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 37,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "“Micro-Finance as an anti-poverty vaccine, is aimed at asset creation and income security of the rural poor in India”. Evaluate the role of the Self Help Groups in achieving the twin objectives along with empowering women in rural India.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 38,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "National Education Policy 2020 is in conformity with the Sustainable Development-Goal-4 (2030). It intends to restructure and reorient education system in India. Critically examine the statement.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 39,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "‘Quadrilateral Security Dialogue (Quad)’ is transforming itself into a trade bloc from a military alliance, in present times — Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 40,
      "Paper": "GS-II",
      "Year": 2020,
      "Question": "What is the significance of Indo-US defence deals over Indo-Russian defence deals ? Discuss with reference to stability in the Indo-Pacific region.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 41,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "Do you think that Constitution of India does not accept \"principle of strict separation of powers rather it is based on the principle of ‘checks and balance’ ? Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 42,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "\"The Central Administrative Tribunal which was established for redressel of grievances and complaints by or against central government employees, nowadays is exercising its powers as an independent judicial authority.\" Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 43,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "What are the methods used by Farmers' organisations to influence the policy makers in India and how effective are these methods?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 44,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "From the resolution of contentious issues regarding distribution of legislative powers by the courts, 'Principle of Federal Supermacy' and \"Harmonious Construction\" have emerged. Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 45,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "What can France learn from the Indian Constitution's approach to secularism?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 46,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "Despite consistent experience of high growth, India still goes with lowest indicators of human development. Examine the issues that make balanced and inclusive development elusive.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 47,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "There is a growing divergence in the relationship between poverty and hunger in India. The shrinking of social expenditure by the government is forcing the poor to spend more on non-food essential items squeezing their food budget. Elucidate.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 48,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "Implementation of Information and Communication Technology (ICT) based projects/Programmes usually suffers in terms of certain vital factors. Identify these factors, and suggest measures for there effective implementation.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 49,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "“The time has come for India and Japan to build a strong contemporary relationship, one involving global and strategic partnership that will have a great significance for Asia and the world as a whole.’ Comment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 50,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "‘Too little cash, too much politics, leaves UNESCO fighting for life.’ Discuss the statement in the light of US’ withdrawal and its accusation of the cultural body as being “anti-Israel bias’.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 51,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "On what grounds a people’s representative can be disqualified under the Representation of Peoples Act, 1951? Also mention the remedies available to such against his disqualification.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 52,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "“Parliament’s power to amend the Constitution is a limited power and it cannot be enlarged into absolute power.” In the light of this statement explain whether Parliament under Article 368 of the Constitution can destroy the Basic Structure of the Constitution by expanding its amending power?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 53,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "The reservation of seats for women in the institutions of local self-government has had a limited on patriachal character of Indian Political Process. Comment.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 54,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "\"The Attorney-General of India is the chief legal adviser and the lowyer of the India\". Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 55,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "Individual Parliamentarian’s role as the national law maker is on a decline, which in turn, has adversely impacted the quality of debates and their outcome. Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 56,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "“In the context of neo-liberal paradigm of development planning, multi-level planning is expected to make operations cost-effective and remove many implementation blockages.’ — Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 57,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "The need for cooperation among various service sectors has been an inherent component of development discourse. Partnership bridges the gap among the sectors. It also sets in motion a culture of ‘collaboration’ and ‘team spirit’. In the light of statements above examine India’s development process.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 58,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "Performance of welfare schemes that are implemented for vulnerable sections is not so effective due to absence of their awareness and active involvement at all stages of policy process. — Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 59,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "\"The long-sustained image of India as a leader of the oppressed and marginalised nations has disappeared on account of its new found role in the emerging global order.\" Elaborate.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 60,
      "Paper": "GS-II",
      "Year": 2019,
      "Question": "‘What introduces friction into the ties between India and the United States is that Washington is still unable to find for India a position in its global strategy, which would satisfy India’s national self-esteem and ambitions.’ Explain with suitable examples.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 61,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "In the light of recent controversy regarding the use of Electronic Voting Machines (EVM), what are the challenges before the Election Commission of India to ensure the trustworthiness of clections in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 62,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Whether National Commission for Scheduled Castes (NCSC) can enforce the implementation of constitutional reservation for the Scheduled Castes in the religious minority institutions? Examine.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 63,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Under what circumstances cam the Financial Emergency be proclaimed by the President of India? What consequences follow when such a declaration remains in force?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 64,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Why do you think the committees are considered to be useful for parliamentary work? Discuss, in this context, the role of the Estimates Committee.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 65,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "\"The Comptroller and Auditor General (CAG) has a very vital role to play.” Explain how this is reflected in the method and terms of his appointment as well as the range of powers he can exercise.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 66,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "\"Policy contradictions among various competing sectors and stakeholders have resulted in inadequate ‘protection and prevention of degradation’ to environment.” Comment with relevant illustrations.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 67,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Appropriate local community-level healthcare intervention is a prerequisite to achieve ‘Health for All’ in India, Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 68,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "E-governance is not only about utilization of the power of new technology, but also much about critical importance of the ‘use value’ of information. Explain.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 69,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "\"India’s relations with Israel have, of late, acquired a depth and diversity, which cannot be rolled back.” Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 70,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "A number of outside powers have entrenched themselves in Central Asia, which is a zone of interest to India. Discuss the implications, in this context, of India's joining the Ashgabat Agreement, 2018.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 71,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Whether the Supreme Court Judgement (July 2018) can settle the political tussle between the Lt. Governor and elected government of Delhi? Examine.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 72,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "How far do you agree with the view that tribunals curtail the jurisdiction of ordinary courts? In view of the above, discuss the constitutional validity and competency of the tribiinals in India.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 73,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "India and USA are two large democracies. Examine the basic tenets on which the two political systems are based.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 74,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "How is the Finance Commission of India constituted? What do you know about the terms of reference of the recently constituted Finance Commission? Discuss.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 75,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Assess the importance of the Panchayat system in India as a part of local government. Apart from government grants, what sources the Panchayats can look out for financing developmental projects?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 76,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "Multiplicity of various commissions for the vulnerable sections of the society leads to problems of overlapping jurisdiction and duplication of functionsy Is it better to merge all commissions into an umbrella Human Rights Commission? Argue your case.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 77,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "How far do you agree with the view that the focus on lack of availability of food as the main cause of hunger takes the attention away from ineffective human development policies in India?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 78,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "The Citizens’ Charter is an ideal instrument of organizational transparency and accountability, but it has its own limitations. Identify the limitations and suggest measures for greater effectiveness of the Citizens’ Charter.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 79,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "What are the key areas of reform if the WTO has to survive in the present context of Trade War’, especially keeping in mind the interest of India?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 80,
      "Paper": "GS-II",
      "Year": 2018,
      "Question": "In what ways would the ongoing US-Iran Nuclear Pact Controversy affect the national interest of India? How should India respond to this situation?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 81,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“The local self-government system in India has not proved to be effective instrument of governance.” Critically examine the statement and give your views to improve the situation.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 82,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Critically examine the Supreme Court’s judgement on ‘National Judicial Appointments Commission Act, 2014’ with reference to appointment of judges of higher judiciary in India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 83,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“Simultaneous election to the Lok Sabha and the State Assemblies will limit the amount of time and money spent in electioneering but it will reduce the government’s accountability to the people.” Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 84,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "How do pressure groups influence Indian political process? Do you agree with this view that informal pressure groups have emerged as more powerful than formal pressure groups in recent years?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 85,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Discuss the role of Public Accounts Committee in establishing accountability of the government to the people.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 86,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“To ensure effective implementation of policies addressing water, sanitation and hygiene needs the identification of the beneficiary segments is to be synchronized with the anticipated outcomes.” Examine the statement in the context of the WASH scheme.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 87,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Does the Rights of Persons with Disabilities Act, 2016 ensure effective mechanism for empowerment and inclusion of the intended beneficiaries in the society? Discuss.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 88,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Hunger and poverty are the biggest challenges for good governance in India still today. Evaluate how far successive governments have progressed in dealing with these humongous problems. Suggest measures for improvement.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 89,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“China is using its economic relations and positive trade surplus as tools to develop potential military power status in Asia.” In the light of this statement, discuss its impact on India as her neighbour.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 90,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "What are the main functions of the United Nations Economic and Social Council (ECOSOC)? Explain different functional commissions attached to it.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 91,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Explain the salient features of the Constitution (One Hundred and First Amendment) Act, 2016. Do you think it is efficacious enough “to remove cascading effect of taxes and provide for common national market for goods and services”?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 92,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Examine the scope of Fundamental Rights in the light of the latest judgement of the Supreme Court on Right to Privacy.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 93,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "The Indian Constitution has provisions for holding joint session of the two Houses of the Parliament. Enumerate the occasions when this would normally happen and also the occasions when it cannot, with reason thereof.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 94,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "To enhance the quality of democracy in India the Election Commission of India has proposed electoral reforms in 2016. What are the suggested reforms and how far are they significant to make democracy successful?",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 95,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Is the National Commission for Women able to strategize and tackle the problems that women face at both public and private spheres? Give reasons in support of your answer.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 96,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“The emergence of the Self-Help Groups (SHGs) in contemporary times points to the slow but steady withdrawal of the State from developmental activities.” Examine the role of the SHGs in developmental activities and the measures taken by the Government of India to promote the SHGs.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 97,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "“Poverty alleviation programmes in India remain mere showpieces until and unless they are backed up by political will.” Discuss with reference to the performance of the major poverty alleviation programmes in India.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 98,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Initially Civil Services in India were designed to achieve the goals of neutrality and effectiveness, which seems to be lacking in the present context. Do you agree with the view that drastic reforms are required in Civil Services? Comment.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 99,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "The question of India’s Energy Security constitutes the most important part of India’s economic progress. Analyze India’s energy policy cooperation with West Asian countries.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 100,
      "Paper": "GS-II",
      "Year": 2017,
      "Question": "Indian diaspora has an important role to play in South-East Asian countries’ economy and society. Appraise the role of Indian diaspora in South-East Asia in this context.",
      "WordLimit": 250,
      "Marks": 20
    },
    {
      "Id": 101,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Discuss the essentials of the 69th Constitutional Amendment Act and anomalies, if any, that have led to recent reported conflicts between the elected representatives and the institution of the Lieutenant Governor in the administration of Delhi. Do you think that this will give rise to a new trend in the functioning of the Indian federal politics?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 102,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "To what extent is Article 370 of the Indian Constitution, bearing marginal note “Temporary provision with respect to the State of Jammu and Kashmir”, temporary? Discuss the future prospects of this provision in the context of Indian polity.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 103,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“The Indian party system is passing through a phase of transition which looks to be full of contradictions and paradoxes.” Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 104,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Exercise of CAG’s powers in relation to the accounts of the Union and the States is derived from Article 149 of the Indian Constitution. Discuss whether audit of the Government’s policy implementation could amount to overstepping its own (CAG) jurisdiction.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 105,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Discuss each adjective attached to the word ‘Republic’ in the ‘Preamble’. Are they defendable in the present circumstances?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 106,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "What was held in the Coelho case ? In this context, can you say that judicial review is of key importance amongst the basic features of the Constitution ?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 107,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Did the Government of India Act, 1935 lay down a federal constitution ? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 108,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "What is a quasi-judicial body ? Explain with the help of concrete examples.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 109,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Professor Amartya Sen has advocated important reforms in the realms of primary education and primary health care. What are your suggestions to improve their status and performance ?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 110,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“In the Indian governance system, the role of non-state actors has been only marginal.” Critically examine this statement.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 111,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“Effectiveness of the government system at various levels and people’s participation in the governance system are inter-dependent.” Discuss their relationship in the context of India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 112,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "In the integrity index of Transparency International, India stands very low. Discuss briefly the legal, political, economic, social and cultural factors that have caused the decline of public morality in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 113,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Has the Indian governmental system responded adequately to the demands of Liberalization, Privatization and Globalization started in 1991? What can the government do to be responsive to this important change?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 114,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“Traditional bureaucratic structure and culture have hampered the process of socio-economic development in India.” Comment.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 115,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Examine the main provisions of the National Child Policy and throw light on the status of its implementation.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 116,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "‘Demographic Dividend in India will remain only theoretical unless our manpower becomes more educated, aware, skilled and creative.” What measures have been taken by the government to enhance the capacity of our population to be more productive and employable ?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 117,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“The broader aims and objectives of WTO are to manage and promote international trade in the era of globalization. But the Doha round of negotiations seem doomed due to differences between the developed and the developing countries.” Discuss in the Indian perspective.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 118,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "Evaluate the economic and strategic dimensions of India’s Look East Policy in the context of the post Cold War international scenario.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 119,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "“Increasing cross-border terrorist attacks in India and growing interference in the internal affairs of several member-states by Pakistan are not conducive for the future of SAARC (South Asian Association for Regional Cooperation).” Explain with suitable examples.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 120,
      "Paper": "GS-II",
      "Year": 2016,
      "Question": "What are the aims and objectives of the McBride Commission of the UNESCO ? What is India’s position on these ?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 121,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Discuss the possible factors that inhibit India from enacting for its citizens a uniform civil code as provided for in the Directive Principles of State Policy.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 122,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Highlight the drawbacks in the existing structure and the extent to which cooperative federalism would answer the shortcomings.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 123,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "In absence of a well-educated and organized local level government system, ‘Panchayats’ and ‘Samitis’ have remained mainly political institutions and not effective instruments of governance. Critically discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 124,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Khap Panchayats have been in the news for functioning as extra-constitutional authorities, often delivering pronouncements amounting to human rights violations. Discuss critically the actions taken by the legislative, executive and the judiciary to set the things right in this regard.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 125,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Resorting to ordinances has always raised concern on violation of the spirit of separation of powers doctrine. While noting the rationales justifying the power to promulgate ordinances, analyze whether the decisions of the Supreme Court on the issue have further facilitated resorting to this power. Should the power to promulgate ordinances be repealed?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 126,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "What are the major changes brought in the Arbitration and Conciliation Act, 1996 through the recent Ordinance promulgated by the President? How far will it improve India’s dispute resolution mechanism? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 127,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Does the right to clean environment entail legal regulations on burning crackers during Diwali? Discuss in the light of Article 21 of the Indian Constitution and Judgement(s) of the Apex Court in this regard.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 128,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Examine critically the recent changes in the rules governing foreign funding of NGOs under the Foreign Contribution (Regulation) Act (FCRA), 1976.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 129,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "The Self-Help Group (SHG) Bank Linkage Programme (SBLP), which is India’s own innovation, has proved to be one of the most effective poverty alleviation and women empowerment programmes. Elucidate.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 130,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "How can the role of NGOs be strengthened in India for development works relating to protection of the environment? Discuss throwing light on the major constraints.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 131,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "The quality of higher education in India requires major improvements to make it internationally competitive. Do you think that the entry of foreign educational institutions would help improve the quality of higher and technical education in the country? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 132,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Public health system has limitations in providing universal health coverage. Do you think that the private sector could help in bridging the gap? What other viable alternatives would you suggest?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 133,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Though there have been several different estimates of poverty in India, all indicate reduction in poverty levels over time. Do you agree? Critically examine with reference to urban and rural poverty indicators.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 134,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "In the light of the Satyam Scandal (2009), discuss the changes brought in corporate governance to ensure transparency, accountability.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 135,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "“If amendment bill to the Whistleblowers Act, 2011 tabled in the Parliament is passed, there may be no one left to protect.” Critically evaluate.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 136,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "“For achieving the desired objectives, it is necessary to ensure that the regulatory institutions remain independent and autonomous.” Discuss in the light of the experiences in recent past.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 137,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Increasing interest of India in Africa has its pros and cons. Critically examine.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 138,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Discuss the impediments India is facing in its pursuit of a permanent seat in UN Security Council.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 139,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Project ‘Mausam’ is considered a unique foreign policy initiative of the Indian Government to improve relationship with its neighbours. Does the project have a strategic dimension? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 140,
      "Paper": "GS-II",
      "Year": 2015,
      "Question": "Terrorist activities and mutual distrust have clouded India-Pakistan relations. To what extent the use of soft power like sports and cultural exchanges could help generate goodwill between the two countries? Discuss with suitable examples.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 141,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Starting from inventing the ‘basic structure’ doctrine, the judiciary has played a highly proactive role in ensuring that ‘India. develops into a thriving democracy. ‘In light of the statement, evaluate the role played by judicial activism in achieving the ideals of democracy.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 142,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Though the federal principle is dominant in our Constitution and that principle is one of its basic features, but it is equally true that federalism under the Indian Constitution leans in favour of a strong Centre, a feature that militates against the concept of strong federalism. Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 143,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "The ‘Powers, Privileges and Immunities of Parliament and its Members’ as envisaged in Article 105 of the-Constitution leave room for a large number of un-codified and un-enumerated privileges to continue. Assess the reasons for the absence of legal codification of the ‘parliamentary privileges’. How can this problem be addressed?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 144,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "What do you understand by the. concept “freedom of speech and expression” ? Does it cover hate speech also ? Why do the films in India stand on a slightly different plane from other forms of expression ? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 145,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Instances of President’s delay in commuting death sentences has come under public debate as denial of justice. Should there be a time limit specified for the President to accept/reject such petitions ? Analyse.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 146,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "The size of the cabinet should be as big as governmental work justifies and as big as the Prime Minister can ‘manage as a team. How far is the.efficacy of a government then inversely related to the size of the cabinet ? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 147,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Though 100 percent FDI is already allowed in non-news media like a trade publication and general entertainment channel, the Government is mulling over the proposal for increased FDI in news media for quite some time. What difference would an increase in FDI make ? Critically evaluate the pros and cons.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 148,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "‘The setting up of a Rail Tariff Authority to regulate fares will subject the cash strapped Indian Railways to demand subsidy for obligation to operate non-profitable routes and services. Taking into account the experience in the power sector, discuss if. the proposed reform is expected to benefit the. consumers, the Indian Railways or, the private container operators.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 149,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "National Human Rights Commission: (NHRC) in India can be most effective when its tasks are adequately supported by other mechanisms that ensure. the accountability of a government. In light of the above observation assess the role of NHRC as an effective complement to the judiciary and other institutions in promoting and protecting human rights standards.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 150,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "The penetration of Self Help Groups-(SHGs) in rural areas. in promoting participation in development programmes is facing socio-cultural. hurdles. Examine.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 151,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Do government’ s schemes for up-lifting vulnerable and backward communities by protecting required social resources for them, lead to their exclusion in establishing businesses in ‘urban economies?”",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 152,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "An athlete participates in Olympics for personal triumph and nation’s ‘glory; victors are showered with cash incentives by various agencies, on their return. Discuss the merit of state sponsored talent hunt and its cultivation as against the rationale of a reward mechanism as encouragement.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 153,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Should the premier institutes like IITs/IIMs. be allowed to retain premier status, allowed more academic independence in designing courses and also decide mode/criteria of selection of students. Discuss in light of the growing challenges.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 154,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Has the Cadre based Civil Services Organization been the cause of slow change in India ? Critically examine.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 155,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Two parallel run schemes of the Government, viz. the Adhaar Card and NPR, one as voluntary and the other as. compulsory, have led to debates at national levels and also litigations. On metits, discuss whether or not both schemes need run concurrently. Analyse the potential of the schemes to achieve developmental benefits and equitable growth.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 156,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "With respect to the South China sea, maritime territorial disputes and rising tension affirm the need for safeguarding maritime security to ensure freedom of navigation and over flight throughout the region. In this context, discuss the bilateral issues between India and China.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 157,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "The aim of Information Technology Agreements (ITAs) is. to lower all taxes and tariffs on information technology products by signatories to zero. What impact would such agreements have on India’s interests ?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 158,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "Some of the International funding agencies have special terms for economic participation stipulating a substantial component of theaid to be used for sourcing equipment from the leading countries. Discuss on merits of such terms and if, there exists a strong case not to accept such conditions in the Indian context.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 159,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "India has recently signed to become founding member? ‘of New Development B Bank (NDB) and also the Asian Infrastructure Investment Bank (AIIB). How will the role of the two Banks be different ? Discuss the strategic significance of these two Banks for India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 160,
      "Paper": "GS-II",
      "Year": 2014,
      "Question": "WTO is an important international institution where decisions taken affect countries in a profound manner. What is. the mandate of WTO and how binding are their decisions ? Critically analyse India’s stand on the latest round of talks on Food security.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 161,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The role of individual MPs (Members of Parliament) has diminished over the years and as a result healthy constructive debates on policy issues are not usually witnessed. How far can this be attributed to the anti-defection law which was legislated but with a different intention ?",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 162,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Discuss Section 66A of IT Act, with reference to its alleged violation of Article 19 of the Constitution.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 163,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Recent directives from Ministry of Petroleum and Natural Gas are perceived by the ‘Nagas’ as a threat to override the exceptional status enjoyed by the State. Discuss in light of Article 371A of the Indian Constitution.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 164,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "‘The Supreme Court of India keeps a check on arbitrary power of the Parliament in amending the Constitution.’ Discuss critically.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 165,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Many State Governments further bifurcate geographical administrative areas like Districts and Talukas for better governance. In light of the above, can it also be justified that more number of smaller States would bring in effective governance at State level ? Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 166,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Constitutional mechanisms to resolve the inter-state water disputes have failed to address and solve the problems. Is the failure due to structural or process inadequacy or both ? Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 167,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Discuss the recommendations of the 134 Finance Commission which have been a departure from the previous commissions for strengthening the local government finances.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 168,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The product diversification of financial institutions and insurance companies, resulting in overlapping of products and services strengthens the case for the merger of the two regulatory agencies, namely SEBI and IRDA. Justify.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 169,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The concept of Mid Day Meal (MDM) scheme is almost a century old in India with early beginnings in Madras Presidency in pre-independent India. The scheme has again been given impetus in most states in the last two decades. Critically examine its twin objectives, latest mandates and success.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 170,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Pressure group politics is sometimes seen as the informal face of politics. With regards to the above, assess the structure and functioning of pressure groups in India.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 171,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The legitimacy and accountability of Self Help Groups (SHGs) and their patrons, the micro-finance outfits, need systematic assessment and scrutiny for the sustained success of the concept. Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 172,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The Central Government frequently complains on the poor performance of the State Governments in eradicating suffering of the vulnerable sections of the society. Restructuring of Centrally sponsored schemes across the sectors for ameliorating the cause of vulnerable sections of population aims at providing flexibility to the States in better implementation. Critically evaluate.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 173,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Electronic cash transfer system for the welfare schemes is an ambitious project to minimize corruption, eliminate wastage and facilitate reforms. Comment.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 174,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The basis of providing urban amenities in rural areas (PURA) is rooted in establishing connectivity. Comment.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 175,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Identify the Millennium Development Goals (MDGs) that are related to health. Discuss the success of the actions taken by the Government for achieving the same.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 176,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Though Citizens’ charters have been formulated by many public service delivery organizations, there is no corresponding improvement in the level of citizens’ satisfaction and quality of services being provided. Analyse.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 177,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "‘A national Lokpal, however strong it may be, cannot resolve the problems of immorality in public affairs.’ Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 178,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The proposed withdrawal of International Security Assistance Force (ISAF) from Afghanistan in 2014 is fraught with major security implications for the countries of the region. Examine in light of the fact that India is faced with a plethora of challenges and needs to safeguard its own strategic interests.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 179,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "What do you understand by ‘The String of Pearls’ ? How does it impact India ? Briefly outline the steps taken by India to counter this.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 180,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Economic ties between India and Japan while growing in the recent years are still far below their potential. Elucidate the policy constraints which are inhibiting this growth.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 181,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The protests in Shahbag Square in Dhaka in Bangladesh reveal a fundamental split in society between the nationalists and Islamic forces. What is its significance for India ?",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 182,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "Discuss the political developments in Maldives in the last two years. Should they be of any cause of concern to India ?",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 183,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "In respect of India—Sri Lanka relations, discuss how domestic factors influence foreign policy.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 184,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "What is meant by Gujral doctrine ? Does it have any relevance today ? Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 185,
      "Paper": "GS-II",
      "Year": 2013,
      "Question": "The World Bank and the IMF, collectively known as the Bretton Woods Institutions, are the two inter-governmental pillars supporting the structure of the world’s economic and financial order. Superficially, the World Bank and the IMF exhibit many common characteristics, yet their role, functions and mandate are distinctly different. Elucidate.",
      "WordLimit": 200,
      "Marks": 10
    }
  ],
  "GSIII": [
    {
      "Id": 1,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Explain the difference between computing methodology of India’s Gross Domestic Product (GDP) before the year 2015 and after the year 2015.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 2,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Distinguish between Capital Budget and Revenue Budget. Explain the components of both these Budgets.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 3,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "How did land reforms in some parts of the country help to improve the socio-economic conditions of marginal and small farmers?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 4,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Do you agree that the Indian economy has recently experienced V-shaped recovery?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 5,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "“Investment in infrastructure is essential for more rapid and inclusive economic growth.” Discuss in the light of India’s experience.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 56,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Describe the key points Of the revised Global Air Quality Guidelines (AQGs) recently released by the World Health Organisation (WHO). How are these different from its last update in 2005? What changes in India's National Clean Air Programme are required to achieve these revised standards? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 59,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Explain the purpose of the Green Grid Initiative launched at World Leaders Summit Of the COP26 UN Climate Change Conference in Glasgow in November 2021. When was this idea first floated in the International Solar Alliance (ISA)? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 60,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Describe the major outcomes of the 26th session of the Conference of the Parties (COP) to the United Nations Framework Convention on Climate Change (UNFCCC). What are the Commitments made by India in this conference? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 61,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Discuss about the vulnerability Of India to earthquake-related hazards. Give examples including the salient features of major disasters caused by earthquakes in different parts of India during the last three decades. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 62,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Describe the various causes and effects of landslides. Mention the important components of the National Landslide Risk Management Strategy.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 93,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "What are the research and developmental, achievements in applied biotechnology? How will these achievements help to uplift the poorer sections Of the society?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 97,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "How is S-400 air defence system technically superior to any Other system presently available in the world? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 106,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "The Nobel Prize in Physics of 2014 was jointly awarded to Akasaki, Amano and Nakamura for the invention Of Blue LEDs in 1990s. How has this invention impacted the everyday life of human beings? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 121,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Keeping in view India's internal security, analyse the impact of cross-border cyber attacks. Also, discuss defensive measures against these sophisticated attacks. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 122,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Analyse the multidimensional Challenges posed by external state and non—state actors, to the internal security Of India. Also, discuss measures required to be taken to combat these threats. (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 123,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "Analyse the complexity and intensity of terrorism, its causes, linkages and obnoxious nexus. Also, suggest measures required to be taken to eradicate the menace of terrorism.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 157,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "How did land reforms in some parts of the country help to improve the socio-economic conditions of marginal and small farmers?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 158,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "How and to what extent would micro-irrigation help in solving India's water crisis? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 159,
      "Paper": "GS-III",
      "Year": 2021,
      "Question": "What are the salient features of the National Food Security Act, 2013? How has the Food Security Bill helped in eliminating hunger and malnutrition in India? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 6,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Explain intra-generational and inter-generational issues of equity from the perspective of inclusive growth and sustainable development.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 7,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Define potential. GDP and explain its determinants. What are the factors that have been inhibiting India from realizing its potential GDP?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 8,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Explain the meaning of investment in an economy in terms of capital formation. Discuss the factors to be considered while designing a concession agreement between a public entity and a private entity.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 9,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Explain the rationale behind the Goods and Services Tax (Compensation to States) Act of 2017. How has COVID-19 impacted the GST compensation fund and created new federal tensions?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 57,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the key features of the National Clean Air Programme (NCAP) initiated by the Government Of India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 63,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Discuss the recent measures initiated in disaster management by the Government of India departing from the earlier reactive approach.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 74,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "How does the draft Environment Impact Assessment (EIA) Notification, 2020 differ from the existing EIA Notification, 2006?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 82,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Describe the benefits of deriving electric energy from sunlight in contrast to conventional energy generation. What are the initiatives offered by our Government for this purpose?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 85,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the salient features of the Jal Shakti Abhiyan launched by the Government Of India for water conservation and water security?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 96,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "COVID-19 pandemic has caused unprecedented devastation worldwide. However, technological advancements are being availed readily to Win over the crisis. Give an account of how technology was sought to aid management of the pandemic.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 100,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What do you understand by nanotechnology and how is it helping in health sector? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 124,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Discuss different types of cyber crimes and measures required to be taken to fight the menace.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 125,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "For effective border area management, discuss the steps required to be taken to deny local support to militants and also suggest ways to manage favourable perception among locals.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 126,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the determinants Of left-wing extremism in the Eastern part Of India? What strategy should Government of India, civil administration and security forces adopt to counter the threat in the affected areas?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 127,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Analyze internal security threats and transborder crimes along Myanmar, Bangladesh and Pakistan borders including the Line of Control (LoC). Also, discuss the role played by various security forces in this regard.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 160,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the main constraints in transport and marketing of agricultural produce in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 161,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the challenges and opportunities of food processing sector in the country? How can income of the farmers be substantially increased by encouraging food processing?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 162,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "How is science interwoven deeply with our lives? What are the striking changes in agriculture triggered off by the science-based technologies?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 163,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "What are the major factors responsible for making the rice-wheat system a success? In spite of this success, how has this system become a bane in India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 164,
      "Paper": "GS-III",
      "Year": 2020,
      "Question": "Suggest measures to improve water storage and irrigation system to make its judicious use under depleting scenario.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 10,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Do you agree with the view that steady GDP growth and low inflation have left the Indian economy in good shape? Give reasons in support of your arguments.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 11,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "It is argued that the strategy of inclusive growth is intended to meet the objectives of inclusiveness and sustainability together. Comment on this statement.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 12,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Enumerate the indirect taxes which have been subsumed in the Goods and Services Tax (GST) in India. Also, comment on the revenue implications of the GST introduced in India since July 2017.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 13,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "The public expenditure management is a challenge to the government of India in the context of budget-making during the post-liberalization period. Clarify it.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 14,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "How is the Grovernrnent India protecting traditional knowledge of medicine from patenting by pharmaceutical companies?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 64,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Vulnerability is an essential element for defining disaster impacts and its threat to people. How and in what ways can vulnerability to disasters be characterized? Discuss different types Of vulnerability with reference to disasters.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 65,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Disaster preparedness is the first step in any disaster management process. Explain how hazard zonation mapping will help disaster mitigation in the case of landslides.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 77,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Coastal sand mining, whether legal or illegal, poses one of thc biggest threats to our environment. Analyze the impact of sand mining along the Indian coasts, citing specific examples.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 89,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Define the concept or carrying capacity of an ecosystem as relevant to an environment. Explain how understanding thin concept is vital while planning for development of a region.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 94,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "How can biotechnology help to improve the living standards of farmers?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 98,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "HOW was India benefitted from the contributions Of Sir M. Visvesvaaraya and Dr. M. S. Swaminathan in the fields of water engineering and agricultural science respectively?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 103,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "What is India's plan to have its own space station and how will it benefit our space programme?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 128,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "The banning of 'Jamaat-e-lslami' in Jammu and Kashmir brought into focus the role of over-ground workers (OGWs) in assisting terrorist organizations. Examine the role played by OGWs in assisting terrorist organizations in insurgency affected areas. Discuss measures to neutralize influence of OGWs.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 129,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "What is CyberDome Project? Explain how it can be useful in controlling interest crimes in India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 130,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Indian Government has recently strengthened the anti-terrorism laws by amending the Unlawful Activities (Prevention) Act (UAPA), 1967 and the NIA Act. Analyze the changes in the context of the prevailing security environment while discussing the scope and reasons for opposing the UAPA by human rights organizations,",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 131,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Cross-border movement of insurgents is only one of the several security challenges facing the policing of the border in North-East India. Examine the various challenges currently emanating across the India-Myanmar border. Also, discuss the Steps to counter the challenges.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 165,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "How far is Integrated Farming System (IFS) helpful in sustaining agricultural production?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 166,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Elaborate on the impact of the National Watershed Project in increasing agricultural production from water-stressed areas.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 167,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "What are the reformative steps taken by the Government to make food grain distribution system more effective?",
      "WordLimit": 250,
      "Marks": 10
    },
    {
      "Id": 168,
      "Paper": "GS-III",
      "Year": 2019,
      "Question": "Elaborate on the policy taken by the Government Of India to meet the challenges of the food processing sector.",
      "WordLimit": 250,
      "Marks": 10
    },
    {
      "Id": 15,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Comment on the important changes introduced in respect of the Long-term Capital Gains Tax (LCGT) and Dividend Distribution Tax (DDT) in the Union Budget for 2018-2019.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 16,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "How are the principles followed by the NITI Aayog different from those followed by the erstwhile Planning Commission in India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 17,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "How would the recent phenomena of protectionism and currency manipulations in world trade affect macroeconomic stability of India?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 18,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Examine the role Of supermarkets in supply chain management of fruits, vegetables and food items. How do they eliminate the number of intermediaries?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 19,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "The China-Pakistan Economic Corridor (CPEC) is viewed as a cardinal subset of China's larger 'One Belt One Road' initiative. Give a brief description Of CPEC and enumerate the reasons why India has distanced itself from the same.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 66,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Describe various measures taken in India for Disaster Risk Reduction (DRR) before and after signing Sendai Framework for DRR (2015—2030)'. How is this framework different from 'Hyogo Framework for Action, 2005'? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 75,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "How does biodiversity vary in India? How is the Biological Diversity Act, 2002 helpful in the conservation Of flora and fauna? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 79,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "With growing energy needs should India keep on expanding its nuclear energy programme? Discuss the facts and fears associated with nuclear energy.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 80,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Sikkim is the first Organic State in India. What are the ecological and economical benefits of Organic State? (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 81,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "\"Access to affordable, reliable, sustainable and modern energy is the sine qua non to achieve Sustainable Development Goals (SDGs).\" Comment on the progress made in India in this regard.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 84,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "What are the impediments in disposing of the huge quantities of discarded solid wastes which are continuously being generated? How do we remove safely the toxic wastes that have been accumulating in our habitable environment?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 88,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "What is a wetland? Explain the Ramsar concept of •wise use' in the context of wetland conservation. Cite two examples of Ramsar Sites from India.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 95,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Why is there so much activity in the field of biotechnology in our country? How has this activity benefitted the field of biopharma? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 99,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Discuss the work of Bose-Einstein Statistics done by Prof. Satyendra Nath Bose and show how it revolutionized the field of Physics.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 132,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Left-Wing Extremism (LWE) is showing a downward trend. but still affects many parts Of the country. Briefly explain the Government Of India's approach to counter the challenges posed by LWE. (Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 133,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Data security has assumed significant importance in the digitized world due to rising cyber crimes. The Justice B. N, Srikrishna Committee Report addresses issues related to data security. What, in your view, are the strengths and weaknesses of the Report relating to the protection of personal data in cyberspace? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 134,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "India's proximity to two of the world's biggest illicit opium-growing states has enhanced her internal security concerns. Explain the linkages between drug trafficking and other illicit activities such as gunrunning, money laundering and human trafficking. What counter-measures should be taken to prevent the same? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 169,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "What do you mean by Minimum Support Price (MSP)? How will MSP rescue the farmers from the low-income trap?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 170,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "Assess the role of National Horticulture Mission (NHM) in boosting the production, productivity and income of horticulture farms, How far has it succeeded in increasing the income of farmers? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 171,
      "Paper": "GS-III",
      "Year": 2018,
      "Question": "How has the emphasis on certain crops brought about Changes in cropping patterns in the recent past? Elaborate the emphasis on millets production and consumption, (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 20,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "One of the intended objectives of Union Budget 2017-18 is to 'transform, energize and clean India'. Analyse the measures proposed in the Budget 2017-18 to achieve the objective.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 21,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Among several factors for India's potential growth, savings rate is the most effective one. Do you agree? What are the other factors available for growth potential?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 22,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Account for the failure of manufacturing sector in achieving the goal of labour-intensive exports rather than capital intensive exports. Suggest measures for more labour intensive rather than capital-intensive exports.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 23,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "What are the salient features of 'inclusive growth\"? Has India been experiencing such a growth process? Analyze and suggest measures for inclusive growth.",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 24,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Examine the development of Airports in India through joint ventures under Public-Private Partnership (PPP) model. What are the challenges faced by the authorities in this regard?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 25,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "\"Industrial growth rate has lagged behind in the overall growth of Gross-Domestic-Product(GDP) in the post reform period\" Give reasons. How far the recent changes in Industrial Policy are capable of increasing the industrial growth rate?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 58,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Climate change is a global problem. How India will 'be affected by climate. change? How Himalayan and coastal states of India will be affected by climate change? (Answer in 250 words) 15",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 67,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "On December 2004, the tsunami brought havoc on fourteen countries including India. Discuss the factors responsible for the occurrence of tsunamis and their effects on life and the economy. In the light of guidelines of NDMA (2010) describe the mechanisms for preparedness to reduce the risk during such events. (Answer in 250 words) 15",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 90,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Not many years ago, river linking was a concept but it is becoming a reality in the country. Discuss the advantages of river linking and its possible impact on the environment.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 102,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Give an account of the growth and development of nuclear science and technology in India. What is the advantage of the fast breeder reactor programme in India? (Answer in 250 words)",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 104,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "India has achieved remarkable successes in unmanned space missions including the Chandrayaan and Mars Orbiter Mission, but has not ventured into manned space missions. What are the main obstacles to launching a manned space mission, both in terms of technology and logistics? Examine critically.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 107,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Stem cell therapy is gaining popularity in India to treat a wide variety Of medical conditions including Leukaemia, Thalassemia, damaged cornea and severe burns. Describe briefly what stem cell therapy is and what advantages it has over other treatments?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 135,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Discuss the potential threats of Cyber attacks and the security framework to prevent them.",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 136,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "The North-East region of India has been infested with insurgency for a very long time. Analyze the major reasons for the survival of armed insurgency in this region.(Answer in 150 words)",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 137,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Mob violence is emerging as a serious law and order problem in India. By giving suitable examples, analyze the causes and consequences of such violence. (Answer in 250 words) 15",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 138,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "The scourge Of terrorism is a grave challenge to national security. What solutions do you suggest to curb this growing menace? What are the major sources Of terrorist funding? (Answer in 250 words) 15",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 172,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "Explain various types of revolutions, that took place in Agriculture after independence in India. How these revolutions have helped in poverty alleviation and food security in India?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 173,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "What are the reasons for poor acceptance of cost-effective small processing unit? How the food processing unit will be helpful to uplift the socio-economic status of poor farmers?",
      "WordLimit": 150,
      "Marks": 10
    },
    {
      "Id": 174,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "What are the major reasons for declining rice and wheat yield in the cropping system? How crop diversification is helpful to stabilise the yield of the crops in the system?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 175,
      "Paper": "GS-III",
      "Year": 2017,
      "Question": "How do subsidies affect 'the cropping pattern, crop diversity and economy of farmers? What is the significance of crop insurance, minimum support price and food processing for small and marginal fanners?",
      "WordLimit": 250,
      "Marks": 15
    },
    {
      "Id": 26,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Women empowerment in India needs gender budgeting. What are the requirements and status of gender budgeting in the Indian context?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 27,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Pradhan Mantri Jan-Dhan Yojana (PMJDY) is necessary för bringing unbanked to the institutional finance fold. Do you agree with this for financial inclusion of the poorer section of the Indian society? Give arguments to justify your opinion.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 28,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "How globalization has led to the reduction of employment in the formal sector of the Indian economy? Is increased informalization detrimental to the development of the country?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 29,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "What are Smart Cities? Examine their relevance for urban development in India. Will it increase rural-urban differences? Give arguments for 'Smart Villages' in the light of PURA and RURBAN Mission.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 30,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Justify the need for FDI for the development of the Indian economy. Why there is gap between MOUs signed and actual FDIs? Suggest remedial steps to be taken for increasing actual FDIs in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 31,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Comment on the challenges for inclusive growth which include careless and useless manpower in the Indian context. Suggest measures to be taken for facing these challenges.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 68,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "The frequency of urban floods due to high-intensity rainfall is increasing over the years. Discussing the reasons for urban floods, highlight the mechanisms for preparedness to reduce the risk during such events.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 69,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "With reference to National Disaster Management Authority (NDMA) guidelines, discuss the measures to be adopted to mitigate the impact of the recent incidents of cloudbursts in many places of Uttarakhand.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 91,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Rehabilitation of human settlements is one of the important environmental impacts which always attracts controversy while planning major projects. Discuss the measures suggested for mitigation of this impact while proposing major developmental projects.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 101,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Why is nanotechnology one of the key technologies of the 21st century? Describe the salient features of Indian Government's Mission on Nanoscience and Technology and the scope of its application in the development process of the country.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 105,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Discuss India's achievements in the field of Space Science and Technology. How the application of this technology has helped India in its socio-economic development?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 108,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Give an account of the current status and the targets to be achieved pertaining to renewable energy sources in the country. Discuss in brief the importance of National Programme on Light Emitting Diodes (LEDs).",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 139,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "The terms 'Hot Pursuit' and Surgical Strikes' are often used in connection with armed action against terrorist attacks. Discuss the strategic impact of such actions.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 140,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "\"Terrorism is emerging as a competitive indusüy over the last few decades.\" Analyze the above statement.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 141,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Border management is a complex task due to difficult terrain and hostile relations with some countries. Elucidate the challenges and strategies for effective border management.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 142,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Use of Internet and social media by non-state actors for subversive activities is a major security concern. How have these been misused in the recent past? Suggest effective guidelines to curb the above threat.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 176,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "What is Water-use efficiency? Describe the role of micro-irrigation in increasing the water-use efficiency.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 177,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "What is allelopathy? Discuss its role In major Cropping systems of irrigated agriculture.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 178,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Discuss the role of land reforms in agricultural development. Identify the factors that were responsible for the success of land reforms in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 179,
      "Paper": "GS-III",
      "Year": 2016,
      "Question": "Given the vulnerability of Indian agriculture to vagaries of nature, discuss the need for crop insurance and bring out the salient features of the Pradhan Mantri Fasal Bima Yojana (PMFBY).",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 32,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "The nature of economic growth in India in recent times is often described as jobless growth. Do you agree with this view ? Give arguments in favour of your answer.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 33,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "In what way could replacement of price subsidy with Direct Benefit Transfer (DBT) change the scenario of subsidies in India? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 34,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Craze for gold in Indians has led to a surge in import of gold in recent years and put pressure on balance of payments and external value of rupee. In view of this, examine the merits of the Gold Monetization Scheme.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 35,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "\"Success of 'Make in India' programme depends on the success of 'Skill India' programme and radical labour reforms.\" Discuss with logical arguments.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 36,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "There is a clear acknowledgement that Special Economic Zones (SEZs) are a tool of industrial development, manufacturing and exports. Recognizing this potential the whole instrumentality of SEZs requires augmentation. Discuss the issues plaguing the success of SEZs with respect to taxation, governing laws and administration.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 37,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "The persisting drives of the Government for development of large industries in backward areas have resulted in isolating the tribal population and the farmers who facæ multiple displacements. With Malkangiri and Naxalban foci, discuss the corrective strategies needed to win the Left Wing Extremism (LWE) doctrine affected citizens back into the mainstream of social and economic growth.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 38,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Livestock rearing has a big potential for providing non-farm employment and income in rural areas. Discuss suggesting suitable measures to promote this sector in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 70,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "The frequency of earthquakes appears to have increased in the Indian subcontinent. However, India's preparedness for mitigating their impact has significant gaps. Discuss various aspects.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 83,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "To what factors can the recent dramatic fall in equipment costs and tariff on solar energy be attributed? What implications does the trend have for thermal power producers and the related industry?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 86,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Discuss the Namami Gange and National Mission for Clean Ganga (NMCG) programmes and causes of mixed results from the previous schemes. What quantum leaps can help preserve the river Ganga better than incremental inputs?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 109,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "What do you understand by 'Standard Positioning Systems' and 'Precision Positioning Systems' in the GPS era? Discuss the advantages India perceives from its ambitious IRNSS programme employing just seven satellites.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 110,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "What are the areas of prohibitive labour that can be sustainably managed by robots? Discuss the initiatives that can propel research in premier research institutes for substantive and gainful innovation.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 111,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Discuss the advantages and security implications of cloud hosting of servers vis-a-vis in-house machine-based hosting for government businesses.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 112,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "India's Traditional Knowledge Digital Library (TKDL), which has a database containing formatted information on more than 2 million medicinal formulations is proving a powerful weapon in the country's fight against erroneous patents. Discuss the pros and cons of making this database publicly available under open-source licensing.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 143,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Human rights activists constantly highlight the view that the Armed Forces Powers) Act, 1958 (AFSPA) is a draconian act leading to cases of human rights abuses by the security forces. What sections of AFSPA are opposed by the activists? Critically evaluate the requirement with to the view held by the Apex Court.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 144,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Religious indoctrination via digital media has resulted in Indian youth joining the ISIS. What is ISIS and its mission? How can ISIS be dangerous for the internal security of our country?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 145,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "The persisting drives of the Government for the development of large industries in backward areas have resulted in isolating the tribal population and the farmers who face multiple displacements. With Malkangiri and Naxalbari foci, discuss the corrective strategies needed to win the Left Wing Extremism (LWE) doctrine affected citizens back into the mainstream of social and economic growth.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 146,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "Considering the threats cyberspace poses for the country, India needs a \"Digital Armed Force\" to prevent crimes. Critically evaluate the National Cyber Security Policy, 2013 outlining the challenges perceived in its effective implementation.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 180,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "In view of the declining average size of land holdings in India which has made agriculture non-viable for a majority of farmers, should contract farming and land leasing be promoted in agriculture? Critically evaluate the pros and cons.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 181,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "How can the 'Digital India' programme help farmers to improve farm productivity and income? What steps has the Government taken in this regard?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 182,
      "Paper": "GS-III",
      "Year": 2015,
      "Question": "What are the impediments in marketing and supply chain management in developing the food processing industry in India? Can e-commerce help in overcoming these bottlenecks?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 39,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Normally countries shift from agriculture to industry and then later to services, but India shifted directly from agriculture to services. What arc the reasons for the huge growth of services vis-a-vis industry in the country? Can India become a developed country without a strong industrial base?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 40,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "\"While we flaunt India's demographic dividend, we ignore the dropping rates Of employability.\" What axe we rnissing While doing so? Where will the jobs that India desperately needs come from? Explain.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 41,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Capitalism has guided the world economy to unprecedented prosperity. However, it often encourages short-sightedness and contributes to vyidC disparities between the rich and the poor. In this light, would it be correct to believe and adopt capitalism for bringing inclusive growth in India? Discuss.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 42,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Explain how Private Public Partnership arrangements, in long gestation infrastructure projccts, can transfer unsustainable liabilities to the future. What arrangements need to be put in place to ensure that successive generations' capacities are not compromised?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 43,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "National Urban Transport Policy emphasises on 'moving people' instead of 'moving vehicles'. Discuss critically the success of the various strategies of thc Government in this regard,",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 44,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Foreign Direct Investment (FDI) in the defence sector is now set to be liberalized. What influence this is expected to have on Indian defence and economy in the short and Icing run?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 45,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "In a globalizcd world, Intellectual Property Rights assume significance and are a source Of litigation. Broadly distinguish between the terms—Copyrights, Patents and Trade Secrets.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 46,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "International civil aviation laws provide all countries complete and exclusive sovereignty over the airspace above their territory. What do you understand by 'airspace? What are the implications of these laws on the space above this airspace? Discuss the challenges which this poses and suggest ways to contain the threat.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 71,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Drought has been recognized as a disaster in view of its spatial expanse, temporal duration, slow onset and lasting effects on vulnerable sections. With a focus on September 2010 guidelines from the National Disaster Management Authority (NDMA), discuss the mechanisms for preparedness to deal with likely EI Nino and La Nina fallouts in India.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 73,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Environmental Impact Assessment studies are increasingly undertaken before a project is cleared by the Government. Discuss the environmental impacts Of coed-fired thermal plants located at coal pitheads.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 92,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Should the pursuit of carbon credits and clean development mechanisms be set up under UNFCCC be maintained even though there has been a massive slide in the value of a carbon credit? Discuss With respect to India's energy needs for economic growth.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 113,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Scientific research in lndian universities is declining, because a career in science is not as attractive as business professions, engineering or administration, and the universities arc becoming consumer-oriented. Critically comment.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 114,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "Can overuse and free availability of antibiotics without a Doctor's prescription, be contributors to the emergence of drug-resistant diseases in India? What are the available mechanisms for monitoring and control? Critically discuss the various issues involved.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 147,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "\"The diverse nature of India as a multi-religious and multi-ethnic society is not immune to the impact of radicalism which is seen in her neighbourhood.\" Discuss along with strategies to be adapted to counter this environment.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 148,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "International civil aviation laws provide all countries complete and exclusive sovereignty over the airspace above their territory, What do you understaru•l by 'airspace? What are the implications Of these laws on the space above this airspace? Discuss the challenges that this poses and Suggest ways to contain the threat.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 149,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "How does illegal transborder migration pose a threat to India's security? Discuss the strategies to curb this, bringing out the factors Which give impetus to such migration.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 150,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "In 2012, the longitudinal marking for high-risk areas for piracy was moved from 65 degrees east to 78 degrees east in the Arabian Sea by the International Maritime Organization. What impact does this have on India's maritime security concerns?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 151,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "China and Pakistan have entered into an agreement for the development of an economic corridor. What threat does this pose to India's security? Critically examine.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 183,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "There is also a point of view that Agricultural Produce Market Committees (APMCs) set up under the State Acts have not only impeded the development of agriculture but also have been the cause of food inflation in India. Critically examine.",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 184,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "\"In the villages itself, no form of credit organization will be suitable except the cooperative society\" - All India Rural Credit Survey. Discuss this statement in the background of agricultural finance in India. What constraints and challenges do financial institutions supplying agricultural finance face? How can technology be used to better reach and Serve ruler clients?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 185,
      "Paper": "GS-III",
      "Year": 2014,
      "Question": "The Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013 has come into effect from 1st January 2014. What are the key issues which would get addressed with the act in place? What implications would it have on industrialization and agriculture in India?",
      "WordLimit": 200,
      "Marks": 12.5
    },
    {
      "Id": 47,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "With a consideration towards the strategy of inclusive growth, the new Companies Bill, 2013 has indirectly made CSR a mandatory obligation. Discuss the challenges expected in its implementation in right earnest. Also discuss other provisions in the Bill and their implications.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 48,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What were the reasons for the introduction of Fiscal Responsibility and Budget Management (FRBM) Act, 2003 ? Discuss critically its salient features and their effectiveness.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 49,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What is the meaning of the term 'tax expenditure' ? Taking housing sector as an example, discuss how it influences the budgetary policies of the government.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 50,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Examine the impact of liberalization on companies owned by Indians. Are they competing with the MNCs satisfactorily ? Discuss.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 51,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Discuss the impact of FDI entry into Multi-trade retail sector on supply chain management in commodity trade pattern of the economy.",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 52,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Though India allowed Foreign Direct Investment (FDI) in what is called multi-brand retail through the joint venture route in September 2012, the FDI, even after a year, has not picked up. Discuss the reasons.",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 53,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Adoption of PPP model for infrastructure development of the country has not been free of criticism. Critically discuss pros and cons of the model.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 54,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Bringing out the circumstances in 2005 which forced amendment to the section 3(d) in Indian Patent Law, 1970, discuss how it has been utilized by the Supreme Court in its judgement in rejecting Novratis' patent application for 'Glivec'. Discuss briefly the pros and cons of the decision.",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 55,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Discuss the rationale for introducing Goods and Services Tax (GST) in India. Bring out critically the reasons for the delay in roll out for its regime. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 72,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "How important is vulnerability and risk assessment for pre-disaster management? As an administrator, what are key areas that you would focus On in a Disaster Management System. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 76,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Write a note on India's green energy corridor to alleviate the problem Of conventional energy. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 78,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What are the consequences of Illegal mining? Discuss the Ministry of Environment and Forests' concept of GO AND NO GO zones for the coal mining sector. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 87,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Enumerate the National Water Policy of India. Taking the river Ganges as an example, discuss the strategies which may be adopted for river water pollution control and management. What are the legal provisions for the management and handling of hazardous wastes in India? [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 115,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What do you understand by Fixed Dose Drug Combinations (FDCs)? Discuss their merits and demerits. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 116,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What do you understand about Umpire Decision Review System in Cricket? Discuss its various components. Explain how silicone on the edge of a bat may fool the system? [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 117,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What is a digital signature? What does its authentication mean? Give various salient built-in features Of a digital signature. [100 words]",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 118,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "How does the 3D printing technology work? List out the advantages and disadvantages of the technology. [100 words]",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 119,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What is an FRP composite material? How are they manufactured? Discuss their applications in the aviation and automobile industries. [100 words]",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 120,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What do you understand about the run-of-river hydroelectricity project? How is it different from any other hydroelectricity project? [100 words]",
      "WordLimit": 100,
      "Marks": 5
    },
    {
      "Id": 152,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Money laundering m).ses a serious security threat to a country's economic sovereignty. What is its significance for India and what steps are required to be taken to control this menace? [200 words] 10",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 153,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What are social networking sites and what security implications do these sites present? [200 words] 10",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 154,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Cyber warfare is considered by some defence analysts to be a larger threat than even A1 Qaeda or terrorism. What do you understand about Cyberwarfare? Outline the cyber threats which India is vulnerable and bring out the state of the country's preparedness to deal with the same. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 155,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Article 244 of the Indian Constitution relates to the administration of scheduled areas and tribal areas. Analyse the impact of non-implementation of the provisions of the Fifth schedule on the growth of Lefft Wing extremism. [200 words] 10",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 156,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "How far are India's internal security challenges linked with border management , particularly in view of the long porous borders with most countries of South Asia and Myanmar? [200 words] 10",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 186,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Food Security Bill is expected to eliminate hunger and malnutrition in India. Critically discuss various apprehensions in its effective implementation along with the concerns it has generated in WTO. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 187,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "What are the different types Of agriculture subsidies given to farmers at the national and at state levels? Critically analyse the agricultural subsidy regime with reference to the distortions created by it. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 188,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "India needs to strengthen measures to promote the pink revolution in the food industry for ensuring better nutrition and health. Critically elucidate the statement. [200 words] 10",
      "WordLimit": 200,
      "Marks": 10
    },
    {
      "Id": 189,
      "Paper": "GS-III",
      "Year": 2013,
      "Question": "Establish relationship between land reforms, agriculture productivity and elimination of poverty in the Indian economy. Discuss the difficulties in designing and implementation of agriculture- friendly land reforms- in India. [200 words]",
      "WordLimit": 200,
      "Marks": 10
    }
  ]
}